#Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

a = [10,'Hello', 34.8,True, 135,'Python',35,8]
for i in a:
    print(f'{i}{type(i)}')







